#Ерженин Александр ДПИ23-1с
import collections

# Задача 2: Произвести жеребьевку между 2 командами шахматистов

# Создадим два кольцевых списка из фамилий шахматистов
team1 = collections.deque(["Андреев", "Белов", "Васильев", "Григорьев", "Дмитриев",
                           "Евгеньев", "Жуков", "Захаров", "Иванов", "Кузнецов"])
team2 = collections.deque(["Михайлов", "Николаев", "Орлов", "Петров", "Романов",
                           "Семенов", "Тарасов", "Устинов", "Федоров", "Харитонов"])

# Выбираем каждый n-й игрок из первой команды
n = 3
players1 = []
for i in range(len(team1)):
    if i % n == n - 1:  # Индексы начинаются с 0, поэтому вычитаем 1 из n
        players1.append(team1[i])
        
# Выбираем каждый k-й игрок из второй команды
k = 4
players2 = []
for i in range(len(team2)):
    if i % k == k - 1:
        players2.append(team2[i])

# Выводим результаты
print("Жеребьевка:\n")
for i in range(min(len(players1), len(players2))):
    print(f"{players1[i]} - {players2[i]}")